/*
 * To change this template, choose Tools | Templates
 * and open the template in the editor.
 */
package converttest;

import java.util.Locale;

/**
 *
 * @author VinhPham
 */
public class VNString {

    public static String toLower(String s) {
        String sResult = "";
        Locale lc = new Locale("vi");
        sResult = s.toLowerCase(lc);
        return sResult;
    }

    public static String toUpper(String s) {
        String sResult = "";
        Locale lc = new Locale("vi");
        sResult = s.toUpperCase(lc);
        return sResult;
    }

    public static String removeSign(String s) {
        char[] arrChar = {'a', 'A', 'd', 'D', 'e', 'E', 'i', 'I', 'o', 'O', 'u', 'U', 'y', 'Y'};
        char[][] uniChar = {
            {'á', 'à', 'ả', 'ã', 'ạ', 'â', 'ấ', 'ầ', 'ẩ', 'ẫ', 'ậ', 'ă', 'ắ', 'ằ', 'ẳ', 'ẵ', 'ặ'},
            {'Á', 'À', 'Ả', 'Ã', 'Ạ', 'Â', 'Ấ', 'Ầ', 'Ẩ', 'Ẫ', 'Ă', 'Ặ', 'Ắ', 'Ằ', 'Ẳ', 'Ẵ', 'Ặ'},
            {'đ'},
            {'Đ'},
            {'é', 'è', 'ẻ', 'ẽ', 'ẹ', 'ê', 'ế', 'ề', 'ể', 'ễ', 'ệ'},
            {'É', 'È', 'Ẻ', 'Ẽ', 'Ẹ', 'Ê', 'Ế', 'Ề', 'Ể', 'Ễ', 'Ệ'},
            {'í', 'ì', 'ỉ', 'ĩ', 'ị'},
            {'Í', 'Ì', 'Ỉ', 'Ĩ', 'Ị'},
            {'ó', 'ò', 'ỏ', 'õ', 'ọ', 'ô', 'ố', 'ồ', 'ổ', 'ỗ', 'ộ', 'ơ', 'ớ', 'ờ', 'ỡ', 'ợ'},
            {'Ó', 'Ò', 'Ỏ', 'Õ', 'Ọ', 'Ô', 'Ố', 'Ồ', 'Ổ', 'Ỗ', 'Ộ', 'Ơ', 'Ớ', 'Ờ', 'Ỡ', 'Ợ'},
            {'ú', 'ù', 'ủ', 'ũ', 'ụ', 'ư', 'ứ', 'ừ', 'ử', 'ữ', 'ự'},
            {'Ú', 'Ù', 'Ủ', 'Ũ', 'Ụ', 'Ư', 'Ứ', 'Ừ', 'Ử', 'Ữ', 'Ự'},
            {'ý', 'ỳ', 'ỷ', 'ỹ', 'ỵ'},
            {'Ý', 'Ỳ', 'Ỷ', 'Ỹ', 'Ỵ'}};
        for (int i = 0; i < uniChar.length; i++) {
            for (int j = 0; j < uniChar[i].length; j++) {
                s = s.replace(uniChar[i][j], arrChar[i]);
            }
        }
        return s;
    }

    public static boolean checkUnicode(String s)
    {
        char[] specChar = {'á', 'à', 'ả', 'ã', 'ạ', 'â', 'ấ', 'ầ', 'ẩ', 'ẫ', 'ậ', 'ă', 'ắ', 'ằ', 'ẳ', 'ẵ', 'ặ',
            'Á', 'À', 'Ả', 'Ã', 'Ạ', 'Â', 'Ấ', 'Ầ', 'Ẩ', 'Ẫ', 'Ă', 'Ặ', 'Ắ', 'Ằ', 'Ẳ', 'Ẵ', 'Ặ',
            'đ', 'Đ',
            'é', 'è', 'ẻ', 'ẽ', 'ẹ', 'ê', 'ế', 'ề', 'ể', 'ễ', 'ệ',
            'É', 'È', 'Ẻ', 'Ẽ', 'Ẹ', 'Ê', 'Ế', 'Ề', 'Ể', 'Ễ', 'Ệ',
            'í', 'ì', 'ỉ', 'ĩ', 'ị',
            'Í', 'Ì', 'Ỉ', 'Ĩ', 'Ị',
            'ó', 'ò', 'ỏ', 'õ', 'ọ', 'ô', 'ố', 'ồ', 'ổ', 'ỗ', 'ộ', 'ơ', 'ớ', 'ờ', 'ỡ', 'ợ',
            'Ó', 'Ò', 'Ỏ', 'Õ', 'Ọ', 'Ô', 'Ố', 'Ồ', 'Ổ', 'Ỗ', 'Ộ', 'Ơ', 'Ớ', 'Ờ', 'Ỡ', 'Ợ',
            'ú', 'ù', 'ủ', 'ũ', 'ụ', 'ư', 'ứ', 'ừ', 'ử', 'ữ', 'ự',
            'Ú', 'Ù', 'Ủ', 'Ũ', 'Ụ', 'Ư', 'Ứ', 'Ừ', 'Ử', 'Ữ', 'Ự',
            'ý', 'ỳ', 'ỷ', 'ỹ', 'ỵ',
            'Ý', 'Ỳ', 'Ỷ', 'Ỹ', 'Ỵ'};
        int i = 0;
        int j = 0;
        for(i = 0; i < s.length(); i++)
            if(s.charAt(i) > '~')
            {
                for(j = 0; j < specChar.length; j++)
                {
                    if(specChar[j] == s.charAt(i))
                        break;
                }
                
                if(j == specChar.length)
                    return false;
            }
        return true;
    }

    public static boolean checkTCVN(String s)
    {
        // Day la cac ki tu trong TCVN
        char[] specChar = {0xB8, 0xB5, 0xB6, 0xB7, 0xB9, 0xA8, 0xBE, 0xBB, 0xBC, 0xBD, 0xC6, 0xA9, 0xCA, 0xC7, 0xC8, 0xC9
        , 0xCB, 0xD0, 0xCC, 0xCE, 0xCF, 0xD1, 0xAA, 0xD5, 0xD2, 0xD3, 0xD4, 0xD6, 0xDD, 0xD7, 0xD8, 0xDC, 0xDE, 0xE3, 0xDF
        , 0xE1, 0xE2, 0xE4, 0xAB, 0xE8, 0xE5, 0xE6, 0xE7, 0xE9, 0xAC, 0xED, 0xEA, 0xEB, 0xEC, 0xEE, 0xF3, 0xEF, 0xF1, 0xF2
        , 0xF4, 0xAD, 0xF8, 0xF5, 0xF6, 0xF7, 0xF9, 0xFD, 0xFA, 0xFB, 0xFC, 0xFE, 0xAE, 0xA1, 0xA2, 0xA3, 0xA4, 0xA5, 0xA6, 0xA7};
        int i = 0;
        int j = 0;
        for(i = 0; i < s.length(); i++)
            if(s.charAt(i) > '~')
            {
                for(j = 0; j < specChar.length; j++)
                {
                    // Neu ki tu do co trong TCVN thi tiep tuc
                    if(specChar[j] == s.charAt(i))
                        break;
                }
                // Neu ko co trong TCVN
                if(j == specChar.length)
                    return false;
            }
        return true;
    }

    public static String VNI2Unicode(String s)
    {
        String VNI[] = {"aù","aø","aû","aõ","aï","aê","aé","aè","aú","aü","aë","aâ","aá","aà","aå","aã","aä",
                        "eù","eø","eû","eõ","eï","eâ","eá","eà","eå","eã","eä","í","ì","æ","ó","ò","où","oø",
                        "oû","oõ","oï","oâ","oá","oà","oå","oã","oä","ô","ôù","ôø","ôû","ôõ","ôï","uù","uø",
                        "uû","uõ","uï","ö","öù","öø","öû","öõ","öï","yù","yø","yû","yõ","î","ñ","AÙ","AØ","AÛ",
                        "AÕ","AÏ","AÊ","AÉ","AÈ","AÚ","AÜ","AË","AÂ","AÁ","AÀ","AÅ","AÃ","AÄ","EÙ","EØ","EÛ",
                        "EÕ","EÏ","EÂ","EÁ","EÀ","EÅ","EÃ","EÄ","Í","Ì","Æ","Ó","Ò","OÙ","OØ","OÛ","OÕ","OÏ",
                        "OÂ","OÁ","OÀ","OÅ","OÃ","OÄ","Ô","ÔÙ","ÔØ","ÔÛ","ÔÕ","ÔÏ","UÙ","UØ","UÛ","UÕ","UÏ",
                        "Ö","ÖÙ","ÖØ","ÖÛ","ÖÕ","ÖÏ","YÙ","YØ","YÛ","YÕ","Î","Ñ"};
        String Uni[] = {"á","à","ả","ã","ạ","ă","ắ","ằ","ẳ","ẵ","ặ","â","ấ","ầ","ẩ","ẫ","ậ",
                        "é","è","ẻ","ẽ","ẹ","ê","ế","ề","ể","ễ","ệ","í","ì","ỉ","ĩ","ị",
                        "ó","ò","ỏ","õ","ọ","ô","ố","ồ","ổ","ỗ","ộ","ơ","ớ","ờ","ở","ỡ","ợ",
                        "ú","ù","ủ","ũ","ụ","ư","ứ","ừ","ử","ữ","ự","ý","ỳ","ỷ","ỹ","ỵ","đ",
                        "Á","﻿À","Ả","Ã","Ạ","Ă","Ắ","Ằ","Ẳ","Ẵ","Ặ","Â","Ấ","Ầ","Ẩ","Ẫ","Ậ",
                        "É","È","Ẻ","Ẽ","Ẹ","Ê","Ế","Ề","Ể","Ễ","Ệ","Í","Ì","Ỉ","Ĩ","Ị",
                        "Ó","Ò","Ỏ","Õ","Ọ","Ô","Ố","Ồ","Ổ","Ỗ","Ộ","Ơ","Ớ","Ờ","Ở","Ỡ","Ợ",
                        "Ú","Ù","Ủ","Ũ","Ụ","Ư","Ứ","Ừ","Ử","Ữ","Ự","Ý","Ỳ","Ỷ","Ỹ","Ỵ","Ð"};
        for(int i = 0; i < VNI.length; i++)
            s = s.replaceAll(VNI[i], Uni[i]);
        return s;
    }

    public static String TCVN2Unicode(String s)
    {
        String TCVN[] = {"EÐ","Uó","Uò","Uô","Ê","È","É","ó","ò","ô","õ","ù","ý","ú","á","â",
                        "è","é","í","Ý","ê","ì","Ð","Ì","Õ","Ò","Ó","Ô","Yý","Yú","EÌ","IÝ",
                        "A¸","Aµ","A¶","A·","A¹","¡","¡¾","¡»","¡¼","¡½","¡Æ","¢","¢Ê","¢Ç",
                        "¢È","¢É","¢Ë","EÎ","EÏ","EÑ","£","£Õ","£Ò","£Ó","£Ô","£Ö","I×","IØ",
                        "IÜ","IÞ","Oã","Oß","Oá","Oâ","Oä","¤","¤è","¤å","¤æ","¤ç","¤é","¥",
                        "¥í","¥ê","¥ë","¥ì","¥î","Uï","Uñ","¦","¦ø","¦õ","¦ö","¦÷","¦ù","Yû",
                        "Yü","Yþ","§","¸","µ","¶","·","¹","¨","¾","»","¼","½","Æ","©","Ç","Ë",
                        "Î","Ï","Ñ","ª","Ö","×","Ø","Ü","Þ","ã","ß","ä","«","å","æ","ç","¬",
                        "ë","î","ï","ñ","ø","ö","÷","û","ü","þ","®"};

       String Uni[] = {"É","Ú","Ũ","Ụ","ấ","ẩ","ẫ","ú","ũ","ụ","ừ","ự","ý","ỳ","ỏ","õ","ố","ộ",
                        "ớ","í","ờ","ỡ","é","è","ế","ề","ể","ễ","Ý","Ỳ","È","Í","Á","﻿À","Ả","Ã",
                        "Ạ","Ă","Ắ","Ằ","Ẳ","Ẵ","Ặ","Â","Ấ","Ầ","Ẩ","Ẫ","Ậ","Ẻ","Ẽ","Ẹ","Ê","Ế",
                        "Ề","Ể","Ễ","Ệ","Ì","Ỉ","Ĩ","Ị","Ó","Ò","Ỏ","Õ","Ọ","Ô","Ố","Ồ","Ổ","Ỗ",
                        "Ộ","Ơ","Ớ","Ờ","Ở","Ỡ","Ợ","Ù","Ủ","Ư","Ứ","Ừ","Ử","Ữ","Ự","Ỷ","Ỹ","Ỵ",
                        "Ð","﻿á","à","ả","ã","ạ","ă","ắ","ằ","ẳ","ẵ","ặ","â","ầ","ậ","ẻ","ẽ","ẹ",
                        "ê","ệ","ì","ỉ","ĩ","ị","ó","ò","ọ","ô","ồ","ổ","ỗ","ơ","ở","ợ","ù","ủ",
                        "ứ","ử","ữ","ỷ","ỹ","ỵ","đ"};

        s = s.replace((char)0xAD, 'ư'); //Thay thế các ký tự ư

        for(int i = 0; i < TCVN.length; i++)
            s = s.replaceAll(TCVN[i], Uni[i]);
        return s;
    }
}
