/*
 * To change this template, choose Tools | Templates
 * and open the template in the editor.
 */

package index;

/**
 *
 * @author tuandom
 */
public class TCVNHelper {

    public static boolean checkTCVN(String s)
    {
        // Day la cac ki tu trong TCVN
        char[] specChar = {0xB8, 0xB5, 0xB6, 0xB7, 0xB9, 0xA8, 0xBE, 0xBB, 0xBC, 0xBD, 0xC6, 0xA9, 0xCA, 0xC7, 0xC8, 0xC9
        , 0xCB, 0xD0, 0xCC, 0xCE, 0xCF, 0xD1, 0xAA, 0xD5, 0xD2, 0xD3, 0xD4, 0xD6, 0xDD, 0xD7, 0xD8, 0xDC, 0xDE, 0xE3, 0xDF
        , 0xE1, 0xE2, 0xE4, 0xAB, 0xE8, 0xE5, 0xE6, 0xE7, 0xE9, 0xAC, 0xED, 0xEA, 0xEB, 0xEC, 0xEE, 0xF3, 0xEF, 0xF1, 0xF2
        , 0xF4, 0xAD, 0xF8, 0xF5, 0xF6, 0xF7, 0xF9, 0xFD, 0xFA, 0xFB, 0xFC, 0xFE, 0xAE, 0xA1, 0xA2, 0xA3, 0xA4, 0xA5, 0xA6, 0xA7};
        int i = 0;
        int j = 0;
        for(i = 0; i < s.length(); i++)
            if(s.charAt(i) > '~')
            {
                for(j = 0; j < specChar.length; j++)
                {
                    // Neu ki tu do co trong TCVN thi tiep tuc
                    if(specChar[j] == s.charAt(i))
                        break;
                }
                // Neu ko co trong TCVN thi thoat luon
                if(j == specChar.length)
                    return false;
            }
        return true;
    }

     public static String TCVN2Unicode(String s)
    {
        String TCVN[] = {"EÐ","Uó","Uò","Uô","Ê","È","É","ú","ó","ò","ô","õ","ù","ý","á","â",
                        "è","é","í","Ý","ê","ì","Ð","Ì","Õ","Ò","Ó","Ô","Yý","Yú","EÌ","IÝ",
                        "A¸","Aµ","A¶","A·","A¹","¡","¡¾","¡»","¡¼","¡½","¡Æ","¢","¢Ê","¢Ç",
                        "¢È","¢É","¢Ë","EÎ","EÏ","EÑ","£","£Õ","£Ò","£Ó","£Ô","£Ö","I×","IØ",
                        "IÜ","IÞ","Oã","Oß","Oá","Oâ","Oä","¤","¤è","¤å","¤æ","¤ç","¤é","¥",
                        "¥í","¥ê","¥ë","¥ì","¥î","Uï","Uñ","¦","¦ø","¦õ","¦ö","¦÷","¦ù","Yû",
                        "Yü","Yþ","§","¸","µ","¶","·","¹","¨","¾","»","¼","½","Æ","©","Ç","Ë",
                        "Î","Ï","Ñ","ª","Ö","×","Ø","Ü","Þ","ã","ß","ä","«","å","æ","ç","¬",
                        "ë","î","ï","ñ","ø","ö","÷","û","ü","þ","®"};

       String Uni[] = {"É","Ú","Ũ","Ụ","ấ","ẩ","ẫ","ỳ","ú","ũ","ụ","ừ","ự","ý","ỏ","õ","ố","ộ",
                        "ớ","í","ờ","ỡ","é","è","ế","ề","ể","ễ","Ý","Ỳ","È","Í","Á","﻿À","Ả","Ã",
                        "Ạ","Ă","Ắ","Ằ","Ẳ","Ẵ","Ặ","Â","Ấ","Ầ","Ẩ","Ẫ","Ậ","Ẻ","Ẽ","Ẹ","Ê","Ế",
                        "Ề","Ể","Ễ","Ệ","Ì","Ỉ","Ĩ","Ị","Ó","Ò","Ỏ","Õ","Ọ","Ô","Ố","Ồ","Ổ","Ỗ",
                        "Ộ","Ơ","Ớ","Ờ","Ở","Ỡ","Ợ","Ù","Ủ","Ư","Ứ","Ừ","Ử","Ữ","Ự","Ỷ","Ỹ","Ỵ",
                        "Ð","﻿á","à","ả","ã","ạ","ă","ắ","ằ","ẳ","ẵ","ặ","â","ầ","ậ","ẻ","ẽ","ẹ",
                        "ê","ệ","ì","ỉ","ĩ","ị","ó","ò","ọ","ô","ồ","ổ","ỗ","ơ","ở","ợ","ù","ủ",
                        "ứ","ử","ữ","ỷ","ỹ","ỵ","đ"};

        s = s.replace((char)0xAD, 'ư'); //Thay thế các ký tự ư

        for(int i = 0; i < TCVN.length; i++)
            s = s.replaceAll(TCVN[i], Uni[i]);
        return s;
    }

     public static String removeTCVNSign(String s) {
        char[] arrChar = {'a', 'A',  'd', 'D', 'e', 'E', 'i', 'I', 'o', 'O', 'u', 'U', 'y', 'Y'};


        String[][] uniChar = {
            {"¸", "µ", "¶", "·", "¹", "¨", "©", "¾", "»", "¼", "½", "Æ", "Ê", "Ç", "È", "É", "Ë"},
            {"¸", "µ", "¶", "·", "¹", "¡", "¢", "¾", "»", "¼", "½", "Æ", "Ê", "Ç", "È", "É", "Ë"},

            {"®"},
            {"§"},

            {"Ð", "Ì", "Î", "Ï", "Ñ", "ª", "Õ", "Ò", "Ó", "Ô", "Ö"},
            {"Ð", "Ì", "Î", "Ï", "Ñ", "£", "Õ", "Ò", "Ó", "Ô", "Ö"},

            { "Ý", "×", "Ø", "Ü", "Þ"},
            {"Ý", "×", "Ø", "Ü","Þ"},

            {"ã", "ß", "á", "â", "ä", "¥", "¤", "í", "ê", "ë", "ì", "î", "è", "å", "æ", "ç", "é"},
            {"ã", "ß", "á", "â", "ä", "¬", "«", "í", "ê", "ë", "ì", "î", "è", "å", "æ", "ç", "é"},

            {"ó", "ï", "ñ", "ò", "ô", "­", "ø", "õ", "ö", "÷", "ù"},
            {"ó", "ï", "ñ", "ò", "ô", "¦", "ø", "õ", "ö", "÷", "ù"},

            {"ý", "ú", "û", "ü", "þ"},
            {"ý", "ú", "û", "ü", "þ"}

            };
        for (int i = 0; i < uniChar.length; i++) {
            for (int j = 0; j < uniChar[i].length; j++) {
                s = s.replaceAll(uniChar[i][j], Character.toString(arrChar[i]));
            }
        }
        return s;
    }
}
